In [1]:
import mysql.connector
import pandas as pd

In [2]:
def createDatabase():
    connection = mysql.connector.connect(
        host='localhost',
        username='root',
        password='password',
        database='test'
        )
    connection.autocommit = True
    cursor = connection.cursor()
    
    cursor.execute("DROP DATABASE IF EXISTS company")
    cursor.execute("CREATE DATABASE IF NOT EXISTS company")
    
    connection.close()
    
    connection = mysql.connector.connect(
        host='localhost',
        username='root',
        password='password',
        database='company'
        )
    cursor = connection.cursor()
    
    return cursor, connection

In [3]:
def dropTable(cursor, connection):
    for query in drop_table_queries:
        cursor.execute(query)
        connection.commit()

In [4]:
def createTable(cursor, connection):
    for query in create_table_queries:
        cursor.execute(query)
        connection.commit()

In [5]:
Customer_Acquisition = pd.read_csv("./Credit_Card_Exploratory_Data/Customer_Acquisition.csv")

In [6]:
Customer_Acquisition.columns

Index(['No', 'Customer', 'Age', 'City', 'Product', 'Limit', 'Company',
       'Segment'],
      dtype='object')

In [7]:
Customer_Acquisition = Customer_Acquisition[['No', 'Customer', 'Age', 'City', 'Product', 'Company',
       'Segment']]

In [8]:
Customer_Acquisition.head()

   No Customer  Age       City   Product Company        Segment
0   1       A1   76  BANGALORE      Gold      C1  Self Employed
1   2       A2   71   CALCUTTA    Silver      C2   Salaried_MNC
2   3       A3   34     COCHIN  Platimum      C3   Salaried_Pvt
3   4       A4   47     BOMBAY  Platimum      C4           Govt
4   5       A5   56  BANGALORE  Platimum      C5  Normal Salary

In [9]:
Repayment = pd.read_csv("./Credit_Card_Exploratory_Data/Repayment.csv")

In [10]:
Repayment.columns

Index(['SL No:', 'Customer', 'Month', 'Amount'], dtype='object')

In [11]:
Repayment = Repayment[['SL No:', 'Customer', 'Month', 'Amount',]]

In [12]:
Repayment.head()

   SL No: Customer      Month     Amount
0       1       A1  12-Jan-04  495414.75
1       2       A1  03-Jan-04  245899.02
2       3       A1  15-Jan-04  259490.06
3       4       A1  25-Jan-04  437555.12
4       5       A1  17-Jan-05  165972.88

In [13]:
Spend = pd.read_csv("./Credit_Card_Exploratory_Data/Spend.csv")

In [14]:
Spend.columns

Index(['Sl No:', 'Customer', 'Month', 'Type', 'Amount'], dtype='object')

In [15]:
Spend.head()

   Sl No: Customer      Month       Type     Amount
0       1       A1  12-Jan-04  JEWELLERY  485470.80
1       2       A1   3-Jan-04      PETRO  410556.13
2       3       A1  15-Jan-04    CLOTHES   23740.46
3       4       A1  25-Jan-04       FOOD  484342.47
4       5       A1  17-Jan-05     CAMERA  369694.07

In [16]:
cursor, connection = createDatabase()

In [17]:
firstTable = ("""CREATE TABLE IF NOT EXISTS Customer_Acquisition(
    No VARCHAR(50) PRIMARY KEY,
    Customer VARCHAR(50),
    Age VARCHAR(50),
    City VARCHAR(50),
    Product VARCHAR(50),
    Company VARCHAR(50),
    Segment VARCHAR(50)
    )""")
cursor.execute(firstTable)
connection.commit()

In [18]:
secondTable = ("""CREATE TABLE IF NOT EXISTS Repayment(
    SL_No VARCHAR(50) PRIMARY KEY,
    Customer VARCHAR(50),
    Month VARCHAR(50),
    Amount VARCHAR(50)
    )""")
cursor.execute(secondTable)
connection.commit()

In [19]:
thirdTable = ("""CREATE TABLE IF NOT EXISTS Spend(
    Sl_No VARCHAR(50) PRIMARY KEY,
    Customer VARCHAR(50),
    Month VARCHAR(50),
    Type VARCHAR(50),
    Amount VARCHAR(50)
    )""")
cursor.execute(thirdTable)
connection.commit()

In [20]:
insFirst = ("""INSERT INTO Customer_Acquisition
    (No, Customer, Age, City, Product, Company, Segment)
    VALUES (%s, %s, %s, %s, %s, %s, %s)
    """)

In [21]:
for i, row in Customer_Acquisition.iterrows():
    cursor.execute(insFirst, list(row))

In [22]:
connection.commit()

In [23]:
insSecond = ("""INSERT INTO Repayment
    (SL_No, Customer, Month, Amount)
    VALUES (%s, %s, %s, %s)
    """)

In [24]:
for i, row in Repayment.iterrows():
    cursor.execute(insSecond, list(row))

In [25]:
connection.commit()

In [26]:
insThird = ("""INSERT INTO Spend
    (Sl_No, Customer, Month, Type, Amount)
    VALUES (%s, %s, %s, %s, %s)
    """)

In [27]:
for i, row in Spend.iterrows():
    cursor.execute(insThird, list(row))

In [28]:
connection.commit()